Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དབང་པོ་གང་མིག་གི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་རྣ་བའི་དབང་པོ་ལ་གནས་པར་འགྱུར་ཏེ། སྣ་ལ་མ་ཡིན། ལྕེ་ལ་མ་ཡིན། ལུས་ཀྱི་དབང་པོ་ལ་མ་ཡིན་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། གང་རྣ་བའི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་སྣའི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དང་། གང་སྣའི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་ལྕེའི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དང་། གང་ལྕེའི་དབང་པོའི་རྒྱུ་ལས་བྱུང་ལ་ལུས་ཀྱི་དབང་པོ་ལ་གནས་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “The Tathāgata truly knows the faculty that is caused by the eye faculty and that will then relate to the ear faculty and not to the faculties of nose, tongue, or body. The Tathāgata also truly knows the faculty that is caused by the ear faculty and will relate to the nose faculty, the one that is caused by the nose faculty and will relate to the tongue faculty, and the one that is caused by the tongue faculty and will relate to the body faculty.

source: སེམས་ཅན་གང་སྦྱིན་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་ཚུལ་ཁྲིམས་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་དེ་ལ་སྦྱིན་པའི་གཏམ་སྟོན་ཏོ། ། གང་ཟག་གང་ཚུལ་ཁྲིམས་ཀྱི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་སྦྱིན་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་སྟོན་ཏོ། ། སེམས་ཅན་གང་བཟོད་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་བརྩོན་འགྲུས་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་བཟོད་པའི་གཏམ་སྟོན་ཏོ། །སེམས་ཅན་གང་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་བཟོད་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་བརྩོན་འགྲུས་ཀྱི་གཏམ་སྟོན་ཏོ། ། སེམས་ཅན་གང་བསམ་གཏན་གྱི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་ཤེས་རབ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་བསམ་གཏན་གྱི་གཏམ་སྟོན་ཏོ། ། སེམས་ཅན་གང་ཤེས་རབ་ཀྱི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་ཤེས་རབ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཤེས་རབ་ཀྱི་གཏམ་སྟོན་ཏོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་བྱའོ། ། སེམས་ཅན་གང་ཉན་ཐོས་ཀྱི་ཐེག་པའི་དབང་པོ་ཅན་ཡིན་ལ། དེ་ཡང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཉན་ཐོས་ཀྱི་ཐེག་པའི་གཏམ་སྟོན་ཏོ། །
en: “To a sentient being who possesses the faculty of generosity but practices morality, the Tathāgata gives instructions in generosity because he sees which faculty is more prominent. To a person who possesses the faculty of morality but practices generosity, the Tathāgata gives instructions in morality because he sees which faculty is more prominent. To a sentient being who possesses the faculty of patient acceptance but practices vigor, the Tathāgata gives instructions in patient acceptance because he sees which faculty is more prominent. To a sentient being who possesses the faculty of vigor but practices patient acceptance, the Tathāgata gives instructions in vigor because he sees which faculty is more prominent. To a sentient being who possesses the faculty of meditation but practices wisdom, the Tathāgata gives instructions in meditation because he sees which faculty is more prominent. To a sentient being who possesses the faculty of wisdom but practices meditation, the Tathāgata gives instructions in wisdom because he sees which faculty is more prominent. All the elements that are conducive to awakening may be added to this enumeration.

source: སེམས་ཅན་གང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་དབང་པོ་ཅན་ཡིན་ལ་དེ་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་གཏམ་སྟོན་ཏོ། ། སེམས་ཅན་གང་ཐེག་པ་ཆེན་པོའི་དབང་པོ་ཅན་ཡིན་ལ། དེ་ཡང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་ཐེག་པ་ཆེན་པོའི་གཏམ་སྟོན་ཏོ། ། སེམས་ཅན་གང་ཐ་མའི་དབང་པོ་ཅན་ཡིན་ལ། དེ་ཡང་ཐེག་པ་ཆེན་པོ་ལ་སྦྱོར་བ་དེ་ལ་དེ་བཞིན་གཤེགས་པས་དབང་པོ་མཆོག་དང་། མཆོག་མ་ཡིན་པ་མཁྱེན་པས་དབང་པོ་ཐ་མ་པའི་གཏམ་སྟོན་ཏོ། ། སེམས་ཅན་སྐལ་བ་མེད་པའི་དབང་པོ་ཅན་སྐལ་བ་མེད་པར་སྣང་བ་དེ་དག་དེ་བཞིན་གཤེགས་པས་སྐལ་བ་མེད་ཅིང་སྣོད་མ་ཡིན་པར་རིག་ནས་བཏང་སྙོམས་སུ་འཇོག་གོ ། སེམས་ཅན་སྐལ་བ་ཡོད་པའི་དབང་པོ་ཅན་སྐལ་བ་ཡོད་པར་སྣང་བ་དག་ལ་དེ་བཞིན་གཤེགས་པས་སྐལ་བ་ཡོད་ཅིང་སྣོད་དུ་རིག་ནས་རི་མོར་བྱས་ཤིང་ཆོས་སྟོན་ཏེ།
en: “To a sentient being who has a faculty conducive to the Śrāvakayāna but practices the Pratyekabuddhayāna, the Tathāgata gives instructions in the Śrāvakayāna because he sees which faculty is more prominent. To a sentient being who has a faculty conducive to the Pratyekabuddhayāna but practices the Śrāvakayāna, the Tathāgata gives instructions in the Pratyekabuddhayāna because he sees which faculty is more prominent. To a sentient being who has a faculty conducive to the Mahāyāna but practices the Pratyekabuddhayāna, the Tathāgata gives instructions in the Mahāyāna because he sees which faculty is more prominent. To a sentient being who has an inferior faculty but practices the Mahāyāna, the Tathāgata gives inferior instructions because he sees which faculty is more prominent. There are sentient beings whose faculties are unfit and who are apparently unsuitable. As the Tathāgata knows that they are unsuitable and cannot receive anything, he will remain neutral toward them. Then again, there are sentient beings whose faculties are fitting and who are clearly suitable. As the Tathāgata knows that they are suitable and can receive it, he gives them instruction in the Dharma once they have paid their respects to him.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་སྨིན་པ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན། དབང་པོ་ཡོངས་སུ་མ་སྨིན་པ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན། འབྱུང་བའི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན། འབྱུང་བ་མ་ཡིན་པའི་དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། སེམས་ཅན་གྱི་དབང་པོའི་རྣམ་པ་གང་ཡིན་པ་དང་། སྦྱོར་བ་གང་ཡིན་པ་དང་། བསམ་པ་གང་ཡིན་པ་དང་། གང་གི་རྒྱུ་ལས་བྱུང་བ་དང་། རྐྱེན་གང་ཡིན་པ་དང་། དམིགས་པ་གང་ཡིན་པ་དང་། རྒྱུ་འཐུན་པ་གང་ཡིན་པ་དང་། སེམས་ཅན་གྱི་དབང་པོའི་མཐའ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “In this way, Śāriputra, the Tathāgata knows which sentient beings have faculties that are fully developed, and he knows which sentient beings have faculties that are not fully developed. He knows which sentient beings have faculties conducive to deliverance, and he knows which sentient beings have faculties not conducive to deliverance. The Tathāgata truly knows the details of any faculty of a sentient being, what its use is, what its disposition is, what its cause is, what conditions it, what it apprehends, what its consequences are, and to what it will amount. He knows all these things about the faculty of a sentient being.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་གསུངས་ཏེ། བདེ་བར་གཤེགས་པས་དེ་སྐད་བཀའ་སྩལ་ནས་སྟོན་པ་ཡང་འདི་སྐད་གསུང་ངོ་། །
en: This is what the Lord said. After the Sugata had said this, he, the teacher, continued as follows:

source: འགྲོ་བའི་དབང་པོ་དེ་ནི་དབང་པོའི་ཕ་རོལ་སོང་། །
en: “The lord of mankind has perfected his faculties

source: སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་དང་བསམ་པའི་ཆོ་ག་མཁྱེན། །
en: And is aware of the conduct and inclinations of sentient beings.

source: འགྲོ་བ་གང་དག་གི་ནི་དབང་པོ་ཅི་འདྲ་བ། །དེ་འདྲར་མི་ཡི་སེང་གེ་དེ་ལ་ཆོས་འཆད་དོ། །
en: According to the varying faculties of living beings, The lion among men proclaims the Dharma.

source: དབང་པོ་དག་ནི་རབ་འབྲིང་ཐ་མར་གྱུར་པ་རྣམས། །དེ་ལ་བདེ་གཤེགས་ཡེ་ཤེས་རྨད་དུ་བྱུང་བ་འཇུག །
en: “Their faculties may be base, mediocre, or excellent. With his marvelous wisdom, the Sugata relates to them accordingly.

source: སེམས་ཅན་བསམ་པ་ཐར་པའི་སྣོད་དུ་གྱུར་མཁྱེན་ནས། །
en: Seeing that there are sentient beings who are fitting as vessels for liberation,

source: སྤྱོད་པ་མཁྱེན་ཅིང་མཁས་པ་མཆོག་གི་ཆོས་སྟོན་ཏོ། །
en: The knower of ways, the wise one, teaches the excellent Dharma. “To the extremists in whom the vices are firm,

source: གང་དག་མཐར་ཕྱིན་སྐྱེ་ཞིང་ཉོན་མོངས་བརྟེན་པ་དང་། །མི་གང་རྣམས་ཀྱི་དབང་པོ་ཡང་བར་གྱུར་པ་དང་། །སྐྱེས་བུ་གང་གི་དབང་པོ་སྣྲེལ་ཞིར་གྱུར་པ་ཡི། །སྤྱོད་པ་མཁྱེན་ནས་དེ་ལྟར་འཐུན་པའི་ཆོས་སྟོན་ཏོ། །
en: To those human beings whose faculties are feeble, To those people whose faculties are varied, To each according to their abilities he proclaims the Dharma.

source: སྐྱེས་བུ་གང་གི་དགེ་བའི་དབང་པོར་གྱུར་པ་དང་། །མི་དགེའི་དབང་པོར་གྱུར་པ་རྣམས་ཀྱང་དེ་བཞིན་མཁྱེན། །
en: “He knows well whose faculties are wholesome, And whose are unwholesome.

source: མིག་ནས་བཟུང་སྟེ་ཡིད་ཀྱི་བར་གྱི་དབང་པོ་དང་། །ཡིད་མི་བདེ་དང་སྡུག་བསྔལ་དབང་མཁྱེན་ཆོས་ཀྱང་སྟོན། །
en: Knowing the faculties from eye to mind, The faculties of suffering and despair, he speaks the Dharma.

source: དད་བརྩོན་དྲན་དང་ཏིང་འཛིན་དེ་བཞིན་ཤེས་རབ་དག །
en: “To those who have the faculty either of faith,

source: སྐྱེས་བུ་གང་ལ་དབང་པོ་འདི་དག་ཡོད་པ་ནི། །དེ་ལ་དད་པའི་གཏམ་སྟོན་དེ་བཞིན་བརྩོན་འགྲུས་དང་། །
en: Of vigor, of mindfulness, of concentration, or of wisdom, He will give instructions in faith, or else in vigor,

source: བསམ་གཏན་ཤེས་རབ་དག་ཀྱང་དམ་པའི་དོན་དུ་སྟོན། ། མི་ཡི་དབང་པོའི་རྣམ་པ་སྤྱོད་པའི་བྱེ་བྲག་གང་། །མི་གང་བསམ་པ་ཅི་འཇུག་དེ་ཡི་དབང་པོ་ཡང་། །ཆོས་མཆོག་རྟོགས་པས་དེ་དག་གི་ནི་སྤྱོད་མཁྱེན་ནས། ། སྡུག་བསྔལ་ཀུན་ལས་ཐར་བར་བྱེད་པའི་ཆོས་འཆད་དོ། །
en: Concentration, or wisdom, teaching according to the ultimate truth. “Depending on the kind of faculties possessed by men, their particular conduct, And the workings of their inclinations, He sees which teaching is best suited to their faculties, And, knowing their dispositions, he speaks the Dharma that liberates from all suffering.

source: གང་གི་དབང་པོ་སངས་རྒྱས་བྱང་ཆུབ་ཕྱིར་ངེས་པ། །ཉན་ཐོས་ཤེས་པའི་རྗེས་འཇུག་ཆོ་ག་མི་ཤེས་པ། །དེ་ལ་བྱང་ཆུབ་རེག་འགྱུར་རྒྱ་ཆེན་གཏམ་རབ་སྟོན། ། བདེ་གཤེགས་སྟོབས་ནི་མཐའ་ཡས་ཐུབ་དཀའ་ལྔ་པའོ། །
en: “There are those who are destined to realize awakening because of their faculties And for whom engagement with the ways of the śrāvaka is not sensible. For these he expounds the highest teaching for the attainment of awakening. This is the Sugata’s fifth power, one that cannot be overcome.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ལྔ་པ་སྟེ། སུས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པར་ཞེས་བྱ་བའི་བར་དུའོ།
en: “This, Śāriputra, is the fifth of the tathāgatas’ tathāgata powers, and having attained that power he asserts the state of the supreme bull and roars the roar of the true lion, and so forth, until as nobody in this world has legitimately turned.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན། ཡང་དག་པར་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་མཁྱེན། ཡང་དག་པར་མ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་མཁྱེན། ལོག་པར་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་མཁྱེན། མ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་དེ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “What is the Tathāgata’s power to know the suitable path in every situation? Śāriputra, with this power, the Tathāgata truly knows the suitable path in every situation. What does he know in this way? He knows the kinds of sentient beings in whom goodness is firmly established. He knows the kinds of sentient beings in whom goodness is not firmly established. He knows the kinds of sentient beings in whom perversity is firmly established, and he knows the kinds of sentient beings in whom it is not firmly established.

source: རྒྱུའི་སྟོབས་ཅན་སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་ཟུར་ཙམ་གྱིས་གོ་བ་དབང་པོ་རྣོ་བའི་སེམས་ཅན་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཀྱང་རུང་། མ་བསྟན་ཀྱང་རུང་། དེ་རྣམ་པར་གྲོལ་བའི་སྐལ་བ་ཡོད་པ་དེ་དག་དེ་བཞིན་གཤེགས་པས་སྔོན་གྱི་རྒྱུའི་སྟོབས་མཁྱེན་ནས་དེ་བཞིན་དུ་འཐུན་པར་ཆོས་སྟོན་ཏོ། ། མ་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་རྐྱེན་གྱི་སྟོབས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་མཚན་ཉིད་ཅན། གལ་ཏེ་འཐུན་པར་འདོམས་ཤིང་རྗེས་སུ་སྟོན་པ་དང་ཕྲད་ན་ རྣམ་པར་གྲོལ་བར་འགྱུར་གྱི། རྗེས་སུ་སྟོན་པ་དང་མ་ཕྲད་ན་ རྣམ་པར་གྲོལ་བར་མི་འགྱུར་བ་དེ་དག་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལྟར་རྒྱུ་དང་རྐྱེན་དང་ལྡན་པའི་གཏམ་ཡང་དག་པར་གསུངས་ཏེ འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ལས་ཆོས་དེ་ཐོས་ནས་ཚུལ་བཞིན་རབ་ཏུ་སྦྱོར་འབྲས་བུ་ཐོབ་པར་འགྱུར་ཏེ། དེ་དག་གི་དོན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །
en: “There are those whose faculties are sharp because of the power of previous actions and who gain understanding with minimal explanation. The Tathāgata might see such sentient beings as fit to be instructed in the Dharma, and he might not. The Tathāgata knows the past causes that give momentum to those who are fit for liberation and will give them teachings that are in accord with it. The kinds of sentient beings who are not firmly established may be influenced under certain conditions and may display signs of ripening. If they meet with conducive circumstances and appropriate guidance, they may attain liberation. Without proper guidance they will not attain liberation. The Tathāgata will then guide them in a way that is suitable for their particular inclinations and circumstances, and with the right endeavor one who receives the Dharma in the presence of the Tathāgata will achieve the result. This is the purpose for which the lords, the buddhas, appear in the world.

source: ལོག་པར་ངེས་པའི་སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་སྦྱོང་བར་མ་བྱས་པ། ཁོ་རེ་ཆུང་བ་བླུན་པ་སྣོད་དུ་མ་གྱུར་པའི་སེམས་ཅན་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་ཆོས་བསྟན་ཀྱང་རུང་། མ་བསྟན་ཀྱང་རུང་སྟེ། རྣམ་པར་གྲོལ་བའི་སྐལ་བ་མེད་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་སྣོད་མ་ཡིན་པར་རིག་ནས་བཏང་སྙོམས་སུ་འཇོག་སྟེ། དེ་དག་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གོ་གྱོན་ཏོ། །
en: “Those sentient beings in whom perversity is firmly established have not been purified. They are slow and confused, and they are not suitable vessels. The Tathāgata might instruct these sentient beings in the Dharma, and he might not. The Tathāgata sees that those who are unfit for liberation are not suitable vessels, and he remains neutral toward them. The bodhisatvas don their armor for the benefit of these beings.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་འདོད་ཆགས་ཀྱི་ལམ་རྣམ་པ་གསུམ་རབ་ཏུ་མཁྱེན་ཏེ། འདོད་ཆགས་ཀྱི་ལམ་སྡུག་པའི་རྣམ་པ་ལས་སྐྱེ་བ་ཡང་ཡོད། འདོད་ཆགས་ཀྱི་ལམ་རྗེས་སུ་ཆགས་པའི་རྣམ་པ་ལས་སྐྱེ་བ་ཡང་ཡོད། འདོད་ཆགས་ཀྱི་ལམ་སྔོན་གྱི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད་དོ། ། ཞེ་སྡང་གི་ལམ་རྣམ་པ་གསུམ་ཡང་རབ་ཏུ་མཁྱེན་ཏེ། ཞེ་སྡང་གི་ལམ་ཁོང་ཁྲོ་བའི་མཚན་མ་ལས་སྐྱེ་བ་ཡང་ཡོད། བསམ་པ་ཡོངས་སུ་རྫོགས་པ་ལས་སྐྱེ་བ་ཡང་ཡོད། སྔོན་གྱི་བག་ལ་ཉལ་ལས་སྐྱེ་བ་ཡང་ཡོད་དོ། ། གཏི་མུག་གི་ལམ་རྣམ་པ་གསུམ་ཡང་རབ་ཏུ་མཁྱེན་ཏེ། ། གཏི་མུག་གི་ལམ་མ་རིག་པའི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད། གཏི་མུག་གི་ལམ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད། ། གཏི་མུག་གི་ལམ་ཐེ་ཚོམ་གྱི་རྒྱུ་ལས་སྐྱེ་བ་ཡང་ཡོད་དེ། དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Moreover, Śāriputra, the Tathāgata knows the three ways of desire: the way desire arises when one encounters something beautiful, the way desire arises when one encounters affection, and the way desire arises on the basis of previous conditions. He knows the three ways of anger: the way anger arises when one projects one’s hostility onto external objects, the way anger arises when one does not attain one’s goal, and the way anger arises due to previously existing dormant tendencies. He knows the three ways of confusion: the way confusion arises because of ignorance, the way confusion arises due to the view of self-entity, and the way confusion arises because of doubt. The Tathāgata knows all this as it really is.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དབང་པོ་རྣོ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་སླ་བའི་ལམ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་རྟུལ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་དཀའ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་རྣོ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་སླ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་རྟུལ་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་སླ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དམིགས་པ་བོར་བའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་བུལ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ལམ་གྱི་རྒྱུན་མ་བཅད་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་བུལ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཡོངས་སུ་ཐུག་པ་མེད་པར་དབུགས་འབྱིན་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་བུལ་ལ་མྱུར་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལ་མ་ཆགས་པའི་ཕྱིར་མངོན་པར་ཤེས་པ་མྱུར་ལ་བུལ་བའི་ལམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། སོ་སོར་རྟོག་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱེད་ལ་སྒོམ་པའི་སྟོབས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། སྒོམ་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱེད་ལ། སོ་སོར་རྟོག་པའི་སྟོབས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། སྒོམ་པའི་སྟོབས་དང་། སོ་སོར་རྟོག་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ལམ་ཡང་ཡོད། སོ་སོར་རྟོག་པའི་སྟོབས་དང་། སྒོམ་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་མི་བྱེད་པའི་ལམ་ཡང་ཡོད་དེ་དེ་ དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “Moreover, Śāriputra, the Tathāgata knows a strenuous path to swift realization for those whose faculties are sharp. He knows a strenuous path to slow realization for those whose faculties are dull. He knows an easy path to swift realization for those whose faculties are sharp. He knows an easy path to slow realization for those whose faculties are dull. He knows a path that, because of the removal of obstructions, is a slow path to slow realization. He knows a path that, because it is continuous, is a slow path to swift realization. He knows a path that, because of infinite relief, is a swift path to slow realization. He knows a swift path to swift realization for the non-dogmatic. “There is a path that refines the power of reflection and not the power of meditation. There is a path that refines the power of meditation and not the power of reflection. There is a path that refines both the power of meditation and the power of reflection. There is a path that refines neither the power of meditation nor the power of reflection. The Tathāgata knows these paths as they really are.

source: བསམ་པ་ཕུན་སུམ་ཚོགས་ལ་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་ལ་བསམ་པ་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། བསམ་པ་ཡང་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་ལ་སྦྱོར་བའང་ཕུན་སུམ་ཚོགས་པ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། བསམ་པ་ཡང་ཕུན་སུམ་ཚོགས་ལ་སྦྱོར་བའང་ཕུན་སུམ་ཚོགས་པའི་ལམ་ཡང་ཡོད་དེ། དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “There is a path of perfect intent and imperfect engagement. There is a path of perfect engagement and imperfect intent. There is a path of neither perfect intent nor perfect engagement. There is a path of both perfect intent and perfect engagement. The Tathāgata knows these paths as they really are.

source: ལུས་སྦྱོང་ལ་ངག་ལ་མ་ཡིན། སེམས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། ངག་སྦྱོང་ལ་ལུས་ལ་མ་ཡིན། སེམས་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། སེམས་སྦྱོང་ལ་ལུས་ལ་མ་ཡིན། ངག་ལ་མ་ཡིན་པའི་ལམ་ཡང་ཡོད། ལུས་ལ་མ་ཡིན། ངག་ལ་མ་ཡིན་ལ་སེམས་ཀྱང་མི་སྦྱོང་བའི་ལམ་ཡང་ཡོད། ལུས་དང་། ངག་དང་། སེམས་སྦྱོང་བའི་ལམ་ཡང་ཡོད་དེ། དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཇུག་པའི་རྒྱུ་དང་། ལྡོག་པའི་རྒྱུའི་ལམ་ཇི་སྙེད་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཐོགས་པ་མེད་པ་འཇུག་གོ །
en: “There is a path that purifies the body but not speech or the mind. There is a path that purifies speech but not the body or the mind. There is a path that purifies the mind but not the body or speech. There is a path that purifies neither the body, speech, nor the mind. There is a path that purifies the body, speech, and the mind. The Tathāgata knows these paths as they really are.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཀུན་ཏུ་འགྲོ་བའི་ལམ་མཁྱེན་པའི་སྟོབས་དེ་ནི་མཐའ་ཡས་མུ་མེད་དེ་ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་མོ། ། བྱང་ཆུབ་སེམས་དཔས་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ཅིང་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “In this way, Śāriputra, the Tathāgata’s unimpeded knowledge determines for every sentient being in all instances which paths are suitable to be engaged with and which are not. Śāriputra, the Tathāgata’s power to know the suitable path in every situation is as boundless as space, and when the bodhisatva learns of this, he develops great faith, trust, and confidence, and he is without uncertainty and doubt. The Tathāgata brings him pleasure, joy, and satisfaction, and as this power is as inconceivable as space, he considers it to be truly wondrous and extraordinary.”

source: ཐམས་ཅད་ལམ་ནི་བདེ་གཤེགས་རབ་ཏུ་མཁྱེན། །
en: “The Sugata knows the paths for all.

source: སེམས་ཅན་ཁམས་ནི་ངེས་རྒྱུ་བཅས་པ་མཁྱེན། །
en: He knows those beings in whom tendencies are fixed.

source: ཡོངས་སུ་སྨིན་པའི་མཚན་ཉིད་མ་ངེས་དང་། །དེ་བཞིན་དབང་པོ་རྒྱུ་དང་ལྡན་པ་མཁྱེན། །
en: He knows the causal makeup of abilities And how to educate those who are undefined.

source: འདོད་ཆགས་ལམ་ནི་རྣམ་པ་གསུམ་ལྡན་དང་། །ཞེ་སྡང་ལམ་གསུམ་དེ་བཞིན་གཏི་མུག་ལྡན། །
en: “There are three paths linked to desire; For anger there are three, and likewise for confusion.

source: རྣམ་གསུམ་རྒྱ་ཆེན་མཐའ་ཡས་ཉོན་མོངས་ལྡན། །
en: When these three proliferate, the vices become limitless.

source: ལམ་ལ་རྐྱེན་དང་རྒྱུ་ནི་སྟོན་པས་མཁྱེན། །
en: The teacher knows the causes and conditions of such paths.

source: དཀའ་བའི་ལམ་ལ་རྣོ་བར་འགྱུར་བ་དང་། །དེ་བཞིན་དབང་པོ་རྟུལ་ཞིང་བུལ་བ་དང་། །སླ་བའི་ལམ་ལ་རྣོ་བར་འགྱུར་བ་དང་། །དེ་བཞིན་བུལ་བའང་འཇིག་རྟེན་མགོན་པོས་མཁྱེན། །
en: “There are strenuous paths for those who are sharp, As well as for those with slow and feeble faculties. There are pleasant paths for those who are sharp, As well as for the slow. The protector of the world knows them.

source: བུལ་བའི་ལམ་ལ་སྦྱོར་བ་བུལ་བ་ཡོད། །
en: “There is a path for the slow with slow purification,

source: དེ་བཞིན་བུལ་བ་ཡིན་ལ་སྦྱོང་བ་རྣོ། །
en: As well as one where the slow are swiftly purified.

source: མྱུར་བའི་ལམ་ལ་བུལ་བར་འགྱུར་བ་དང་། །དེ་བཞིན་དེ་ལ་མ་ཆགས་མྱུར་བ་འང་ཡོད། །
en: There is a swift path for the slow And a swifter one, too, for the non-dogmatic.

source: ལམ་ནི་སོ་སོར་རྟོག་པ་སྐྱེད་བྱེད་ལ། །ཡང་དག་སྒོམ་པ་སྐྱེད་པ་མ་ཡིན་དང་། །སྒོམ་པ་དག་ནི་སྐྱེད་པར་བྱེད་པ་དང་། །གཉི་ག་ཁྱད་པར་སྦྱོར་ལྡན་སྐྱེད་པ་ཡོད། །
en: “There is a path that encourages reflection But does not encourage the practice of meditation. Then again there is one for meditation And one where they are both emphasized.

source: ལམ་ནི་བསམ་པ་ཡོངས་སུ་སྦྱོང་བྱེད་ལ། །སྦྱོར་བ་དག་ནི་སྦྱོང་བར་མི་བྱེད་ཡོད། །
en: “There is a path for purifying one’s motivation, With no purification of engagement.

source: རེས་འགའ་གཉི་ག་སྦྱོང་བར་བྱེད་པའང་ཡོད།
en: Then there is one where both can be purified.

source: དེ་དག་སངས་རྒྱས་ཐམས་ཅད་གཟིགས་པས་མཁྱེན། །
en: These the omniscient Buddha knows.

source: ལུས་ལ་རྣམ་པར་སྦྱོང་ལ་ངག་མི་སྦྱོང་། །
en: “There is one where the body is purified

source: སེམས་ཀྱང་རྣམ་པར་སྦྱོང་བ་མ་ཡིན་དང་། །ངག་རྣམས་དང་ནི་ལུས་ཀྱང་རབ་སྦྱོང་ལ། །སེམས་ནི་རེས་འགའ་མི་སྦྱོང་བ་ཡང་ཡོད། །སེམས་ནི་རབ་སྦྱོང་ངག་ལ་མ་ཡིན་ཏེ། །ལུས་ཀྱང་རྣམ་པར་སྦྱོང་བ་མ་ཡིན་དང་། །
en: But speech and mind are not purified. Speech as well as body can also be purified, While the mind might sometimes not be purified. “There is one where mind is purified, While speech and body are not purified.

source: ངག་དང་དེ་བཞིན་སེམས་ཀྱང་རབ་སྦྱོང་ལ། །རེས་འགའ་ལུས་ནི་སྦྱོང་བར་མི་འགྱུར་ཡོད། །
en: Then speech and mind might be purified, And the body might not be purified.

source: ལུས་དང་དེ་བཞིན་ངག་སེམས་སྦྱོང་ལམ་དང་། །ཇི་ལྟར་ལྡོག་དང་འཇུག་པར་འགྱུར་བ་རྣམས། །སངས་རྒྱས་ཐམས་ཅད་གཟིགས་པས་རབ་མཁྱེན་ཏེ། །
en: “The omniscient Buddha knows the path That purifies the body as well as speech and mind, And whether one turns back or carries on.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དྲུག་པ།
en: This is the sixth power of the Tathāgata.

source: །ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དྲུག་པ་སྟེ། སྟོབས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་བ་ནས་སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “This, Śāriputra, is the sixth of the tathāgata powers, and having attained that power he asserts the state of the supreme bull and roars the roar of the true lion, and so forth, until as nobody in this world has legitimately turned.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ལྡང་བ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན།
en: “What is the Tathāgata’s power to know how the corruptions arise and are purified in the context of the liberative meditative states, the attainments of concentration? Śāriputra, with this, the Tathāgata truly knows how the corruptions and their purification come about in relation to oneself and others in the context of the liberative meditative states, the attainments of concentration. What does he know in this way? The Tathāgata truly knows the causes and conditions from which stem the corruptions of sentient beings. The Tathāgata also truly knows the causes and conditions from which stems the complete purification of sentient beings.
